from math import tan, pi, cos

data1 = [
    (1, 77.1, 291.9),
    (2, 77.8, 291.0),
    (3, 77.4, 292.3),
    (4, 77.6, 292.1),
    (5, 77.5, 292.5),
    (6, 78.1, 292.1),
]

sum_1 = 0
for row in data1:
    print(f"({row[0]},{row[1]},{row[2]},{(row[2]-row[1])/4:.1f}),")
    sum_1 += (row[2] - row[1]) / 4
print(f"平均值: {sum_1/len(data1):.1f}")
print(f"折射率: {tan(sum_1/len(data1) / 180 * pi):.2f}")


data2 = [69.1, 71.9, 69.1, 68.5, 68.1, 70, 68, 70.1]
print("平均值:", sum(data2) / len(data2))

data3 = [
    (1, 235, 134.0, 0.0),
    (2, 221, 120.5, 0.0),
    (3, 200, 95.8, 0.0),
    (4, 167.1, 67.2, 0.0),
    (5, 119.4, 40.5, 0.0),
    (6, 74.1, 20.3, 0.0),
    (7, 36.8, 8.5, 0.0),
    (8, 12.8, 3.2, 0.0),
]

for i in range(len(data3)):
    phi = 10 * (i + 1)
    cos2 = cos(phi / 180 * pi) ** 2
    print(f"({data3[i][0]},{data3[i][1]},{phi:.1f},{cos2:.2f}),")

print(0.01 / (cos(53.6 / 180 * pi) ** 2))  # 0.8
